### 연습문제

In [82]:
for k,v in s4.items():
    if v >3000000:
        print(f'{k}의 인구는 300만이 넘습니다.')

인천의 인구는 300만이 넘습니다.
대구의 인구는 300만이 넘습니다.

### 연습문제

In [47]:
s4[[2]]

인천    2890451
dtype: int64

In [48]:
s4[1:3]

부산    3448737
인천    2890451
dtype: int64

In [54]:
s4[[1,2,3]]

부산    3448737
인천    2890451
대구    2466052
dtype: int64

### 연습문제

In [124]:
c = pd.Series({'서울':9904312,'부산':3448737,'인천':2890451,'대구':2466052}) #2015년 인구
c2 = pd.Series({'서울':9631482,'부산':3393191,'인천':2632035,'대전':1490158}) # 2010년 인구
rk = c-c2
rk2 = rk[rk.notnull()]
rk3 = rk2.argmax() # 최대값의 index를 반환해줌 
rk2[[rk3]]

서울    272830.0
dtype: float64

### 연습문제

In [114]:
rs['서울'] = 2.83 
rs['인천'] = 9.82
rs

#방법 2
rs['서울':'인천'] = (2.83,9.82)
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

### 연습문제

In [122]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자": 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value,fin2_index)

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

### 연습문제

In [194]:
ser_finance1 - ser_finance2
ser_finance1 + ser_finance2
ser_finance1 * ser_finance2
ser_finance1 / ser_finance2
# 결과가 모두다 float형태로 나오는데 Nan이 있기 때문에

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

### 연습문제

In [126]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

### 연습문제

In [264]:
data = {
    "이름" : ['바디앤짐', '프레토휘트니스', '비비짐', '바디디자인샵'],
    "네이버 리뷰수" : [81, 75, 54,12],
    "블로그 리뷰수" : [73, 107, 36, 2],
    "평점" : [4.3, 4.27, 5, 4.83],
    "오픈시간" : ["06시", "06시", "06", "06시"],
    "종료시간" :['24시','24시' , '23시', '22시'],
    '휴무일' : ['매달2,4번째 일요일','매달2,4번째 일요일','매달1,3,5번쨰 일요일','매주일요일'],
    '가격' : ['3개월21만원' , '3개월22만원','3개월24만원','3개월24만원'],
    '거리' : [302,269,449,235]
}
columns = ["이름", "네이버 리뷰수", "블로그 리뷰수", "평점", "오픈시간", "종료시간",'휴무일','가격','거리']
index = ['헬스장1','헬스장2','헬스장3','헬스장4']
df = pd.DataFrame(data, index = index, columns = columns)
df


df.loc[df['종료시간']=='24시','죵료시간점수'] =3
df.loc[df['종료시간']=='23시','죵료시간점수'] =2
df.loc[df['종료시간']=='22시','죵료시간점수'] =1
df

df.loc[df['거리']<=300,'거리점수'] =2
df.loc[df['거리']>300,'거리점수']=1
df

df.loc[df['가격']=='3개월24만원','가격점수'] =1
df.loc[df['가격']=='3개월22만원','가격점수'] =2
df.loc[df['가격']=='3개월21만원','가격점수'] =3
df

df['최종점수'] = df['죵료시간점수'] * 0.3 +df['거리점수'] * 0.4 +df['가격점수'] * 0.5
df

,이름,네이버 리뷰수,블로그 리뷰수,평점,오픈시간,종료시간,휴무일,가격,거리,죵료시간점수,거리점수,가격점수,최종점수
헬스장1,바디앤짐,81,73,4.30,06시,24시,"매달2,4번째 일요일",3개월21만원,302,3.0,1.0,3.0,2.8
헬스장2,프레토휘트니스,75,107,4.27,06시,24시,"매달2,4번째 일요일",3개월22만원,269,3.0,2.0,2.0,2.7
헬스장3,비비짐,54,36,5.00,06,23시,"매달1,3,5번쨰 일요일",3개월24만원,449,2.0,1.0,1.0,1.5
헬스장4,바디디자인샵,12,2,4.83,06시,22시,매주일요일,3개월24만원,235,1.0,2.0,1.0,1.6

### 연습문제

In [290]:
df['수학'] #1번
df[['국어','영어']] #2번
df['평균'] = (df['국어'] + df['영어'] + df['수학']) / 3 #3번
df[:1] #4번
df2 = df.T
df2
df2['향단']

국어    70
영어    60
수학    80
Name: 향단, dtype: int64

In [230]:
np.random.seed(0)
data = np.random.randn(24).reshape(6,4)
index = pd.date_range('20130226',periods=6)
columns=['A','B','C','D']
df = pd.DataFrame(data,index,columns)
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165